{
    "sidebar": {
        "side-bar1": "Introduction",
        "side-bar2": "Principle of Relationship",
        "side-bar3": "Principles of Development",
        "side-bar4": "References"
    },
    "homecontent": {
        "title": "Principles of dialectical materialism",
        "concept": "Concept : ",
        "concept-content": "Dialectical materialism is the basic methodological method in Marxist-Leninist philosophy, aiming to help people understand the nature and laws of development of the material world and consciousness..",
        "target": "Target : ",
        "target-content": "Present the content of dialectical materialism and analyze the two main principles, thereby seeing their application in practice..",
        "title2": "Two principles of dialectical materialism",
        "principle1": "Principle of universal connection",
        "principle1-content1": "It is the interaction, the bond, the mutual influence between those individual things and phenomena. It is like invisible strings connecting everything together.",
        "principle2": "Principle of development",
        "principle1-content2": "Development is the process of moving upward, from low to high, from simple to complex, from less perfect to more perfect.",
        "home-content": "Looking at this picture, what do you see?",
        "connectprinciple": "Nature of the connections",
        "connect-titleadd1": "Common Connection Principles",
        "connect-titleadd1-content1": "Contact : ",
        "connect-titleadd1-sub-content1": "It is the mutual impact, the bond, the mutual influence between those individual things and phenomena. It's like invisible wires that connect everything together.",
        "connect-titleadd1-content2": "Popular Contacts : ",
        "connect-titleadd1-sub-content2": "Pointing out that the relationship, the interaction does not only occur in a few places, in a few fields, but it is an inherent characteristic, existing everywhere, in all things, phenomena, in all areas of the world.",
        "connect-title1": "Objectivity",
        "connect-content1": "Connections exist independently of human consciousness. They are not thought or imposed by someone but are the inherent nature of things and phenomena.",
        "connect-title2": "Universality",
        "connect-content2": "Connections exist everywhere, in every sphere of nature, society, and thought. No thing or phenomenon is completely isolated.",
        "connect-title3": "Variety and Richness",
        "connect-content3": "Relationships are not monotonous but manifest in countless different forms, depending on the nature, role and mode of impact of things and phenomena.",
        "connect-subcontent1": "Direct and indirect common contact",
        "connect-subcontent2": "The universal connection of nature and phenomena",
        "connect-subcontent3": "Primary and secondary common connections",
        "connect-subcontent4": "Common connections, of course, and random",
        "connect-titleadd2": "Common Connection Meaning",
        "connect-titleadd2-content1": "Considering things and phenomena in the overall relationships.",
        "connect-titleadd2-content2": "Avoid one-sided, isolated, or absolutizing an individual element.",
        "connect-titleadd2-content3": "Properly analyze the nature, location, and role of relationships to recognize and solve problems effectively.",
        "developprinciple": "Principles of development",
        "develop-content1": "Development is the process of movement from low to high, from simple to complex",
        "develop-content2": "Development is not only quantitative growth but also quality change",
        "develop-content3": "“Development is the process of moving upwards, from low to high, from simple to complex, from less complete to more complete” (Textbook of Marxist-Leninist Philosophy, 2019, p.104).",
        "develop-title1": "Content of the tenet of development",
        "develop-sub-content1": "All things and phenomena in the world are constantly moving and developing",
        "develop-sub-content2": "The source of development lies in the internal contradictions of things",
        "develop-sub-content3": "Development takes place according to the law",
        "develop-sub-content4": "“The source of development is contradiction, that is, the struggle between opposites in the interior of things and phenomena” (Marxist-Leninist Philosophy Textbook, 2019, p.105).",
        "develop-title2": "Aspects of the Principle of Development",
        "develop-title2-sub-content1": "Conflict is the driving force : ",
        "develop-title2-sub-sub-content1": "The struggle between opposites in things promotes development.",
        "develop-title2-sub-content2": "Amount to substance : ",
        "develop-title2-sub-sub-content2": "Changes in quantity to the threshold will create a qualitative leap.",
        "develop-title2-sub-content3": "Non-linear development : ",
        "develop-title2-sub-sub-content3": "There may be a temporary setback, but the general trend is progressive.",
        "develop-title3": "The Meaning of the Principle of Development",
        "develop-title3-sub-content1": "In awareness : ",
        "develop-title3-sub-sub-content1": "Understand things in motion, not fixed.",
        "develop-title3-sub-content2": "In practice : ",
        "develop-title3-sub-sub-content2": "Encourage innovation and conflict resolution for progress.",
        "develop-title4": "Conclude",
        "develop-title4-sub-content1": "The principle of development explains the nature of the world's movement and progress.",
        "develop-title4-sub-content2": "Helps direct dynamic thinking and creative action.",
        "develop-title4-sub-content3": "Call: Identify contradictions and promote growth in life!",
        "develop-titleadd": "Nature of development",
        "develop-titleadd-content1": "Objectivity",
        "develop-titleadd-sub-content1": "The source of development lies in the thing itself.",
        "develop-titleadd-content2": "Universality",
        "develop-titleadd-sub-content2": "The development process takes place in any phenomenon, in any field.",
        "develop-titleadd-content3": "Inheritance",
        "develop-titleadd-sub-content3": "The development of creating the new and inheriting will retain the rational, renovate the elements that are still effective, and at the same time dismiss the negative and outdated aspects..",
        "develop-titleadd-content4": "Richness and diversity",
        "develop-titleadd-sub-content4": "Each phenomenon has a different development process. It does not always take place in a straight line, but is very winding and complicated.",
        "develop-titleadd2": "Real-life examples"
    }
}