{
    "sidebar": {
        "side-bar1": "Giới thiệu",
        "side-bar2": "Nguyên lý về mối liên hệ",
        "side-bar3": "Nguyên lý về sự phát triển",
        "side-bar4": "Tài liệu tham khảo"
    },
    "homecontent": {
        "title": "Nguyên lý của phép biện chứng duy vật",
        "concept": "Khái niệm : ",
        "concept-content": "Phép biện chứng duy vật là phương pháp luận cơ bản trong triết học Mác - Lênin, nhằm giúp con người hiểu rõ bản chất và quy luật phát triển của thế giới vật chất và ý thức.",
        "target": "Mục tiêu :",
        "target-content": "Trình bày nội dung của phép biện chứng duy vật và phân tích hai nguyên lý chính, từ đó thấy được ứng dụng của chúng trong thực tiễn.",
        "title2": " Hai nguyên lý của phép biện chứng duy vật",
        "principle1": "Nguyên lý về mối liên hệ phổ biến",
        "principle1-content1": "Chính là sự tác động qua lại, sự ràng buộc, sự ảnh hưởng lẫn nhau giữa những sự vật, hiện tượng riêng lẻ đó. Nó giống như những sợi dây vô hình kết nối mọi thứ lại với nhau.",
        "principle2": "Nguyên lý về sự phát triển",
        "principle1-content2": "Sự phát triển là quá trình vận động đi lên, từ thấp đến cao, từ đơn giản đến phức tạp, từ kém hoàn thiện đến hoàn thiện hơn",
        "home-content": "Nhìn tấm hình này, bạn thấy gì ?",
        "connectprinciple": "Tính chất của các mối liên hệ",
        "connect-titleadd1": "Nguyên lý về mối liên hệ phổ biến",
        "connect-titleadd1-content1": "Liên hệ : ",
        "connect-titleadd1-sub-content1": "Là sự tác động qua lại, sự ràng buộc, sự ảnh hưởng lẫn nhau giữa những sự vật, hiện tượng riêng lẻ đó. Nó giống như những sợi dây vô hình kết nối mọi thứ lại với nhau.",
        "connect-titleadd1-content2": "Mối liên hệ phổ biến : ",
        "connect-titleadd1-sub-content2": "Chỉ ra rằng sự liên hệ, sự tác động qua lại không chỉ xảy ra ở một vài chỗ, một vài lĩnh vực mà nó là một đặc tính vốn có, tồn tại ở khắp mọi nơi, trong mọi sự vật, hiện tượng, trong mọi lĩnh vực của thế giới",
        "connect-title1": "Tính khách quan",
        "connect-content1": "Các mối liên hệ tồn tại một cách độc lập với ý thức của con người. Chúng không phải do ai đó nghĩ ra hay áp đặt mà là bản chất vốn có của sự vật, hiện tượng.",
        "connect-title2": "Tính phổ biến",
        "connect-content2": "Mối liên hệ tồn tại ở mọi nơi, trong mọi lĩnh vực của tự nhiên, xã hội và tư duy. Không có sự vật, hiện tượng nào hoàn toàn cô lập.",
        "connect-title3": " Tính đa dạng và phong phú",
        "connect-content3": "Các mối liên hệ không đơn điệu mà biểu hiện dưới vô vàn hình thức khác nhau, tùy thuộc vào bản chất, vai trò và cách thức tác động của các sự vật, hiện tượng.",
        "connect-titleadd2": "Ý nghĩa mối liên hệ phổ biến",
        "connect-titleadd2-content1": "Xem xét sự vật, hiện tượng trong tổng thể các mối liên hệ.",
        "connect-titleadd2-content2": "Tránh phiến diện, cô lập, hoặc tuyệt đối hóa một yếu tố riêng lẻ.",
        "connect-titleadd2-content3": "Phân tích đúng tính chất, vị trí, vai trò của các mối liên hệ để nhận thức và giải quyết vấn đề hiệu quả.",
        "connect-subcontent1": "Mối liên hệ phổ biến trực tiếp và gián tiếp",
        "connect-subcontent2": "Mối liên hệ phổ biến bản chất và hiện tượng",
        "connect-subcontent3": "Mối liên hệ phổ biến chủ yếu và thứ yếu",
        "connect-subcontent4": "Mối liên hệ phổ biến tất nhiên và ngẫu nhiên",
        "developprinciple": "Nguyên lý về sự phát triển",
        "develop-content1": "Sự phát triển là quá trình vận động từ thấp đến cao, từ đơn giản đến phức tạp",
        "develop-content2": "Sự phát triển không chỉ là tăng trưởng số lượng mà còn là thay đổi chất lượng",
        "develop-content3": "“Sự phát triển là quá trình vận động đi lên, từ thấp đến cao, từ đơn giản đến phức tạp, từ kém hoàn thiện đến hoàn thiện hơn” (Giáo trình Triết học Mác - Lênin, 2019, tr.104).",
        "develop-title1": "Nội dung của nguyên lý về sự phát triển",
        "develop-sub-content1": "Mọi sự vật, hiện tượng trong thế giới đều không ngừng vận động và phát triển",
        "develop-sub-content2": "Nguồn gốc của sự phát triển nằm ở mâu thuẫn bên trong của sự vật",
        "develop-sub-content3": "Sự phát triển diễn ra theo quy luật",
        "develop-sub-content4": "“Nguồn gốc của sự phát triển là mâu thuẫn, tức là sự đấu tranh giữa các mặt đối lập trong nội tại của sự vật, hiện tượng” (Giáo trình Triết học Mác - Lênin, 2019, tr.105).",
        "develop-title2": "Các khía cạnh của nguyên lý về sự phát triển",
        "develop-title2-sub-content1": "Mâu thuẫn là động lực : ",
        "develop-title2-sub-sub-content1": "Sự đấu tranh giữa các mặt đối lập trong sự vật thúc đẩy phát triển..",
        "develop-title2-sub-content2": "Lượng dẫn đến chất : ",
        "develop-title2-sub-sub-content2": "Thay đổi về lượng đến ngưỡng sẽ tạo nhảy vọt về chất.",
        "develop-title2-sub-content3": "Phát triển không tuyến tính : ",
        "develop-title2-sub-sub-content3": "Có thể thụt lùi tạm thời, nhưng xu hướng chung là tiến bộ. ",
        "develop-title3": "Ý nghĩa của nguyên lý về sự phát triển",
        "develop-title3-sub-content1": "Trong nhận thức : ",
        "develop-title3-sub-sub-content1": "Hiểu sự vật trong sự vận động , không cố định.",
        "develop-title3-sub-content2": "Trong thực tiễn : ",
        "develop-title3-sub-sub-content2": "Khuyễn khích đổi mới, giải quyết mâu thuẫn để tiến bộ.",
        "develop-title4": "Kết luận",
        "develop-title4-sub-content1": "Nguyên lý về sự phát triển giải thích bản chất vận động, tiến bộ của thế giới.",
        "develop-title4-sub-content2": "Giúp định hướng tư duy động và hành động sáng tạo.",
        "develop-title4-sub-content3": "Kêu gọi: Hãy nhận diện mâu thuẫn và thúc đẩy sự phát triển trong cuộc sống!",
        "develop-titleadd": "Tính chất của sự phát triển ",
        "develop-titleadd-content1": "Tính khách quan",
        "develop-titleadd-sub-content1": "Nguồn gốc của sự phát triển nằm ngay trong bản thân sự vật.",
        "develop-titleadd-content2": "Tính phổ biến",
        "develop-titleadd-sub-content2": "Quá trình phát triển diễn ra ở bất kỳ sự vật hiện tượng nào, ở bất kỳ lĩnh vực nào.",
        "develop-titleadd-content3": "Tính kế thừa",
        "develop-titleadd-sub-content3": "Sự phát triển tạo ra cái mới, kế thừa sẽ giữ lại những cái hợp lý, cải tạo những yếu tố còn tác dụng, đồng thời gạt bỏ những mặt tiêu cực, lạc hậu..",
        "develop-titleadd-content4": "Tính phong phú, đa dạng",
        "develop-titleadd-sub-content4": "Mỗi sự vật hiện tượng có quá trình phát triển không giống nhau. Không phải lúc nào cũng diễn ra theo đường thẳng mà rất quanh co, phức tạp.",
        "develop-titleadd2": "Ví dụ thực tế"
    }
}